app/controllers/joins_controller.rb

SELECT "joins".* FROM "joins"
---
  def index
    @joins = Join.all

INSERT INTO "joins" ("user_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["song_id", 5], ["created_at", "2020-11-17 17:44:52.473587"], ["updated_at", "2020-11-17 17:44:52.473587"]]
---
  def create
    @join = Join.new(join_params)

    if @join.save