app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("artist", "title", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "someone"], ["title", "something good"], ["time", "3:00"], ["created_at", "2020-11-16 16:05:30.054507"], ["updated_at", "2020-11-16 16:05:30.054507"]]

  def update
    if @song.update(song_params)
---
UPDATE "songs" SET "time" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["time", "2:00"], ["updated_at", "2020-11-16 16:06:15.518979"], ["id", 7]]

  def destroy
    @song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 7]]