app/controllers/songs_controller.rb

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]
---
  def destroy
    @song.destroy