app/controllers/users_controller.rb

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Joe"], ["updated_at", "2020-11-17 16:24:45.284493"], ["id", 1]]
---
  def update
    if @user.update(user_params)